CSI API ETABS v1
cConstraint.GetDiaphragm Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDiaphragm(
	string Name,
	ref eConstraintAxis Axis,
	ref string CSys
)
Function GetDiaphragm (
	Name As String,
	ByRef Axis As eConstraintAxis,
	ByRef CSys As String
) As Integer
Dim instance As cConstraint
Dim Name As String
Dim Axis As eConstraintAxis
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.GetDiaphragm(Name,
	Axis, CSys)
int GetDiaphragm(
	String^ Name,
	eConstraintAxis% Axis,
	String^% CSys
)
abstract GetDiaphragm :
        Name : string *
        Axis : eConstraintAxis byref *
        CSys : string byref -> int
Parameters
Name
Type: System.String
Axis
Type: ETABSv1.eConstraintAxis
CSys
Type: System.String
Return Value
Type: Int32
See Also
Reference
cConstraint Interface
ETABSv1 Namespace